# MepSpotBottomElevation Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..MepSpotBottomElevation Property
ParameterTypeId Class See Also
---
"Spot Bottom Elevation": used for both design and fabrication components
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId MepSpotBottomElevation { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MepSpotBottomElevation As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MepSpotBottomElevation {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace